/***********************************************************************************
	* __  ____    __ ______
	* \ \/ /\ \  / /|  __  \	官方网站： www.edu118.com
	*  \  /  \_\/_/ | |  \ |					
	*  /  \   |  |  | |__/ |					
	* /_/\_\  |__|  |______/					
	*
	*版权◎深圳信盈达科技有限公司（郑州分部）保留所有权
	*文件名：delay.h
	*作者：XYD_WYC
	*版本号：v1.0
	*日期：2020.08.14
	*描述：STM32F103R8最小系统 延时函数
	*备注：最小系统
	*历史记录：
	*
***********************************************************************************/  
#ifndef _DELAY_H_
#define _DELAY_H_

#include "stm32f10x.h"

#define Delay_nop_nms(x) Delay_nop_nus(x*1000)

void Delay_nop_1us(void);
void Delay_nop_nus(uint32_t time);

#endif
