/***********************************************************************************
	* __  ____    __ ______
	* \ \/ /\ \  / /|  __  \	官方网站： www.edu118.com
	*  \  /  \_\/_/ | |  \ |					
	*  /  \   |  |  | |__/ |					
	* /_/\_\  |__|  |______/					
	*
	*版权◎深圳信盈达科技有限公司（郑州分部）保留所有权
	*文件名：main.h
	*作者：XYD_WYC
	*版本号：v1.0
	*日期：2020.08.14
	*描述：STM32F103R8T6最小系统 主函数头文件 
	*备注：最小系统
	*历史记录：
	*			2020.09.28		更新最小系统
***********************************************************************************/ 
#ifndef _MAIN_H_
#define _MAIN_H_

#include "stm32f10x.h"
#include "stdio.h"
#include "stdlib.h"
#include "string.h"

#include "systick.h"
#include "delay.h"
#include "led.h"
#include "key.h"

#include "water.h"
#endif
